campusServer/app/views/users/show_follow.html.erb

SELECT COUNT(*) FROM `microposts` WHERE `microposts`.`user_id` = 990634930
---
      <span><%= link_to "view my profile", @user %></span>
      <span><b>Microposts:</b> <%= @user.microposts.count %></span>