campusServer/app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 990634930 LIMIT 1
SELECT  `microposts`.* FROM `microposts` WHERE `microposts`.`user_id` = 990634930  ORDER BY `microposts`.`created_at` DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `microposts` WHERE `microposts`.`user_id` = 990634930
---
  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(page: params[:page])

INSERT INTO `users` (`username`, `email`, `password_digest`, `firstname`, `lastname`, `bio`, `major`, `hometown`, `gender`, `created_at`, `updated_at`, `activation_digest`) VALUES ('testusername', 'testemail@email.com', '$2a$04$U1pRL3j3IT8rKfSqKu4ak.s5bpexcHTlAAuQX0MsjIPVVItJXY/nm', 'Tyler', 'Younkins', 'this is my bio', 'computer science', 'Sykesville,MD', 'male', '2015-11-19 19:50:24', '2015-11-19 19:50:24', '$2a$04$rwfF2p8ycsXoQkLHhm7VQ.0cBn1Re7maNgOu.k1r2QXolpuDvIzCS')
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 990634930 LIMIT 1
---
  def update
    @user = User.find(params[:id])

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 990634930 LIMIT 1
---
  def following
    @title = "Following"
    @user  = User.find(params[:id])

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 990634930 LIMIT 1
---
  def followers
    @title = "Followers"
    @user  = User.find(params[:id])